// --створити масив з:
// - та вивести його в консоль

// - з 5 числових значень
let numArray = [1,2,3,4,5];
console.log(numArray);

// - з 5 стічкових значень
let strArray = ['Orest','Gans','Hello world','phone','fight'];
console.log(strArray);

// - з 5 значень стрічкового, числового та булевого типу
let booArray = [true,false,true,false,true];
console.log(booArray);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
console.log(strArray[0],strArray[1]);



// - є масив [2,17,13,6,22,31,45,66,100,-18] :

let numbers = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while
 let i = 0;

 while (i <numbers.length){
     console.log(numbers[i]);
     i++;
 }
console.log('*********************');

//     2. перебрати його циклом for
let numbers1 = [2,17,13,6,22,31,45,66,100,-18];

for (let i = 0; i < numbers1.length; i++) {
    const number = numbers1[i];
    console.log(number);
}
console.log('*********************');
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
let numbers2 = [2,17,13,6,22,31,45,66,100,-18];
let y = 0;
while (y <numbers2.length){
    if(y % 2 !== 0){
        console.log(numbers2[y]);
    }
    y++;
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
 let anyType = [true,false,'fffff',1,2,3,'dfdsf',false,true];
for (const element of anyType) {
    if (typeof element === "boolean"){
        console.log(element);
    }
}
console.log('******************');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
for (const element of anyType) {
    if (typeof element === "string"){
        console.log(element);
    }
}
console.log('*******************');
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
for (const element of anyType) {
    if (typeof element === "number"){
        console.log(element);
    }
}

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write



// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор